dungvd0309/differential-robot-firmware/esp32-firmware/motor_encoders.h
#pragma once
#include <esp32-hal-gpio.h>
#include <Arduino.h>

class MotorEncoders {

  private:
    static MotorEncoders* _instance;  // Lưu con trỏ của instance cho hàm ngắt ngoài static

    uint8_t _s1l, _s2l, _s1r, _s2r;   // Các chân sensor encoder của động cơ trái và phải (Left, Right)
    volatile long _left_count = 0;    // Biến đếm xung encoder trái
    volatile long _right_count = 0;   // Biến đếm xung encoder phải


    // Cac bien dung cho tinh toan van toc
    double _wheel_radius;                  // Bán kính bánh xe
    double _wheel_cpr;                     // Số xung encoder 1 vòng bánh xe
    long _prev_left_count = 0;             // Biến đếm xung của lần tính vận tốc trước
    long _prev_right_count = 0;            // Biến đếm xung của lần tính vận tốc trước
    unsigned long _prev_update_time = 0;   // Thời điểm lần tính vận tốc trước
    volatile double _left_count_rate = 0;  // count/s
    volatile double _right_count_rate = 0; // count/s
    
  public:
    MotorEncoders(uint8_t s1l = 255, uint8_t s2l = 255, uint8_t s1r = 255, uint8_t s2r = 255
                , double wheel_cpr = 11, double wheel_radius = 0.065);
      
    // Hàm khai báo các chân encoder
    void init();

    // Hàm đếm xung 
    inline void IRAM_ATTR updateLeft();
    inline void IRAM_ATTR updateRight();

    // Hàm phục vụ ngắt ngoài
    static void IRAM_ATTR isrLeft();
    static void IRAM_ATTR isrRight();

    // Hàm getter hanh trinh dong co
    long getLeftCount() const { return _left_count; }
    long getRightCount() const { return _right_count; }
    double getLeftAngleRad() const { return (double)_left_count / _wheel_cpr * 2 * PI; } // rad
    double getRightAngleRad() const { return (double)_right_count / _wheel_cpr * 2 * PI; } // rad
    double getLeftAngle() const { return getLeftAngleRad() * 180 / PI; } // deg
    double getRightAngle() const { return getRightAngleRad() * 180 / PI; } // deg


    // Ham getter van toc dong co
    void updateVelocities();

    double getLeftAngularVelocity() const { return _left_count_rate / _wheel_cpr * 2 * PI; } // rad/s
    double getRightAngularVelocity() const { return _right_count_rate / _wheel_cpr * 2 * PI; } // rad/s

    double getLeftLinearVelocity() const { return getLeftAngularVelocity() * _wheel_radius; } // m/s
    double getRightLinearVelocity() const { return getRightAngularVelocity() * _wheel_radius; } // m/s

    double getLeftRpm() const { return _left_count_rate / _wheel_cpr * 60; } // rpm
    double getRightRpm() const { return _right_count_rate / _wheel_cpr * 60; } // rpm

};
